unklstewy/DOTM_HotBox/sdkconfig.defaults.esp32s3
# Target options
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Serial console to USB Serial JTAG
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# 16MB Flash Configuration
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# 8MB Octal PSRAM Configuration
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_TIME_CLEANUP=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_MEMTEST=n

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_esp32s3.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_esp32s3.csv"

# Wi-Fi / LwIP / Network
CONFIG_ESP32_WIFI_ENABLED=y
CONFIG_ESP_NETIF_TCPIP_ADAPTER_COMPATIBLE_SYSTEM=y
CONFIG_LWIP_MAX_ACTIVE_TCP=16
CONFIG_LWIP_MAX_LISTENING_TCP=16

# Web Portal & WebSocket settings
CONFIG_HTTPD_MAX_OPEN_SOCKETS=7
CONFIG_HTTPD_MAX_URI_HANDLERS=16

# Disable Seeed BSP or specific P4 components on S3
CONFIG_SC_BSP_D1001=n
CONFIG_SC_BRIDGE_ENABLED=y

# TinyUSB Settings
CONFIG_TINYUSB=y
CONFIG_TINYUSB_CDC_NUM=0
CONFIG_TINYUSB_HID_NUM=1

# Enable HTTPD WebSocket Server Support
CONFIG_HTTPD_WS_SUPPORT=y
